# Выведите в консоль таблицу умножения
# от 2х2 до 9х10 как на школьной тетрадке.
# Таблицу создайте в виде однострочного
# генератора, где каждый элемент генератора —
# отдельный пример таблицы умножения.
# Для вывода результата используйте «принт»
# без перехода на новую строку.

# # Создание генератора таблицы умножения
# multiplication_table = ((i, j, i*j) for i in range(2, 10) for j in range(2, 11))
#
# # Вывод таблицы умножения
# for i, j, result in multiplication_table:
#     print(f"{i}x{j}={result}", end="\t" if j < 10 else "\n")


# print("\n\n".join(["\n".join([f"{j:2} * {i:^2} = {i * j:2}\t\t{j + 1:2} * {i:^2} = {i * (j + 1):2}\t\t{j + 2:2} * {i:^2} = {i * (j + 2):2}\t\t{j + 3:2} * {i:^2} = {i * (j + 3):2}" for i in range(2, 11)]) for j in range(2, 10, 4)]))


# print("\n\n".join(["\n".join([f"{j:2} * {i:^2} = {i * j:2}\t\t{j + 1:2} * {i:^2} = {i * (j + 1):2}\t\t{j + 2:2} * {i:^2} = {i * (j + 2):2}\t\t{j + 3:2} * {i:^2} = {i * (j + 3):2}"
#                               for i in range(2, 11)])
#                    for j in range(2, 10, 4)]))

print("\n".join([
    f"{j:2} * {i:^2} = {i*j:2}\t\t{j+1:2} * {i:^2} = {i*(j+1):2}\t\t{j+2:2} * {i:^2} = {i*(j+2):2}\t\t{j+3:2} * {i:^2} = {i*(j+3):2}"
    for i in range(2, 11) for j in range(2, 3)
]),
"\n\n",
"\n".join([
    f"{j:2} * {i:^2} = {i*j:2}\t\t{j+1:2} * {i:^2} = {i*(j+1):2}\t\t{j+2:2} * {i:^2} = {i*(j+2):2}\t\t{j+3:2} * {i:^2} = {i*(j+3):2}"
    for i in range(2, 11) for j in range(6, 7)
]))